In [1]:
import pandas as pd

In [54]:
df = pd.read_csv("/data/stocks.csv")

In [55]:
df.head()

,date,open,high,low,close,volume,adjclose,symbol
0,2000-07-17,95.437500,97.500000,92.750000,96.62500,3508100.0,74.269199,XLNX
1,2000-07-17,22.625000,22.750000,22.437500,22.56250,201600.0,13.486140,ES
2,2000-07-17,6.750002,6.937503,6.375000,6.50000,1235700.0,5.241649,CHK
3,2000-07-17,19.812501,20.187500,19.500001,20.18750,1434100.0,3.806147,NI
4,2000-07-17,30.500000,30.687500,30.000000,30.03125,254600.0,19.811830,SNA

In [5]:
df.date = pd.to_datetime(df.date)

In [6]:
df.head()

,date,open,high,low,close,volume,adjclose,symbol
0,2000-07-17,95.437500,97.500000,92.750000,96.62500,3508100.0,74.269199,XLNX
1,2000-07-17,22.625000,22.750000,22.437500,22.56250,201600.0,13.486140,ES
2,2000-07-17,6.750002,6.937503,6.375000,6.50000,1235700.0,5.241649,CHK
3,2000-07-17,19.812501,20.187500,19.500001,20.18750,1434100.0,3.806147,NI
4,2000-07-17,30.500000,30.687500,30.000000,30.03125,254600.0,19.811830,SNA

In [56]:
df.date.max()

'2016-08-15'

In [57]:
df.query("date > '2016-08-10'").date.unique()

array(['2016-08-11', '2016-08-12', '2016-08-15'], dtype=object)

In [58]:
df3 = df.query("date > '2016-08-10'")
df3.sample(10)

,date,open,high,low,close,volume,adjclose,symbol
1856317,2016-08-12,64.059998,64.360001,63.770000,64.239998,1357800.0,64.239998,ADI
1856568,2016-08-12,139.000000,139.470001,138.039993,138.979996,140400.0,138.979996,DNB
1856026,2016-08-11,28.000000,28.260000,27.950001,28.080000,4643800.0,28.080000,CSX
1856549,2016-08-12,39.230000,39.919998,38.939999,39.820000,15747700.0,39.820000,M
1856759,2016-08-15,68.769997,68.790001,67.930000,67.989998,947200.0,67.989998,O
1856037,2016-08-11,122.889999,123.919998,122.629997,123.610001,662600.0,123.610001,PH
1856447,2016-08-12,25.500000,25.500000,25.000000,25.219999,1666000.0,25.219999,ETFC
1856746,2016-08-15,62.529999,62.669998,61.139999,61.169998,1806200.0,61.169998,WEC
1856263,2016-08-12,67.779999,68.300003,67.550003,68.239998,1130400.0,68.239998,STT
1856805,2016-08-15,54.369999,54.540001,54.060001,54.169998,1438500.0,54.169998,PLD

In [19]:
df_pivot = df3.pivot("symbol", "date", "adjclose")
df_pivot.head()

date    2016-08-11  2016-08-12  2016-08-15
symbol
A        48.130001   48.139999   48.439999
AA       10.420000   10.170000   10.520000
AAL      34.959999   34.919998   35.869999
AAP     166.710007  166.000000  167.759995
AAPL    107.930000  108.180000  109.480003

In [20]:
df_pivot.columns = ["d1", "d2", "d3"]

In [22]:
df_pivot.head()

                d1          d2          d3
symbol
A        48.130001   48.139999   48.439999
AA       10.420000   10.170000   10.520000
AAL      34.959999   34.919998   35.869999
AAP     166.710007  166.000000  167.759995
AAPL    107.930000  108.180000  109.480003

In [23]:
df_pivot["p1"] = (df_pivot["d2"] - df_pivot["d1"])/df_pivot["d1"]
df_pivot["p2"] = (df_pivot["d3"] - df_pivot["d2"])/df_pivot["d2"]
df_pivot.head()

                d1          d2          d3        p1        p2
symbol
A        48.130001   48.139999   48.439999  0.000208  0.006232
AA       10.420000   10.170000   10.520000 -0.023992  0.034415
AAL      34.959999   34.919998   35.869999 -0.001144  0.027205
AAP     166.710007  166.000000  167.759995 -0.004259  0.010602
AAPL    107.930000  108.180000  109.480003  0.002316  0.012017

In [24]:
(48.139999 - 48.130001) /48.130001

0.00020772906279397459

In [26]:
(35.869999 - 34.919998)/34.919998

0.027205070286659246

In [28]:
X = df_pivot.loc[:, "p1":"p2"]
X = (X - X.mean(axis = 0)) / X.std(axis = 0)

In [29]:
from sklearn import cluster

In [38]:
symbols = df_pivot.index.values
symbols

array(['A', 'AA', 'AAL', 'AAP', 'AAPL', 'ABBV', 'ABC', 'ABT', 'ACN',
       'ADBE', 'ADI', 'ADM', 'ADP', 'ADS', 'ADSK', 'AEE', 'AEP', 'AES',
       'AET', 'AFL', 'AGN', 'AIG', 'AIV', 'AIZ', 'AJG', 'AKAM', 'ALB',
       'ALK', 'ALL', 'ALLE', 'ALXN', 'AMAT', 'AME', 'AMG', 'AMGN', 'AMP',
       'AMT', 'AMZN', 'AN', 'ANTM', 'AON', 'APA', 'APC', 'APD', 'APH',
       'ATVI', 'AVB', 'AVGO', 'AVY', 'AWK', 'AXP', 'AYI', 'AZO', 'BA',
       'BAC', 'BAX', 'BBBY', 'BBT', 'BBY', 'BCR', 'BDX', 'BEN', 'BHI',
       'BIIB', 'BK', 'BLK', 'BLL', 'BMY', 'BSX', 'BWA', 'BXP', 'C', 'CA',
       'CAG', 'CAH', 'CAT', 'CB', 'CBG', 'CBS', 'CCI', 'CCL', 'CELG',
       'CERN', 'CF', 'CFG', 'CHD', 'CHK', 'CHRW', 'CI', 'CINF', 'CL',
       'CLX', 'CMA', 'CMCSA', 'CME', 'CMG', 'CMI', 'CMS', 'CNC', 'CNP',
       'COF', 'COG', 'COH', 'COL', 'COP', 'COST', 'CPB', 'CRM', 'CSCO',
       'CSRA', 'CSX', 'CTAS', 'CTL', 'CTSH', 'CTXS', 'CVS', 'CVX', 'CXO',
       'D', 'DAL', 'DD', 'DE', 'DFS', 'DG', 'DGX', 'DHI', 'DHR', 'DIS',
       'DISCA', 'DISCK', 'DLPH', 'DLR', 'DLTR', 'DNB', 'DO', 'DOV', 'DOW',
       'DPS', 'DRI', 'DTE', 'DUK', 'DVA', 'DVN', 'EA', 'EBAY', 'ECL',
       'ED', 'EFX', 'EIX', 'EL', 'EMC', 'EMN', 'EMR', 'ENDP', 'EOG',
       'EQIX', 'EQR', 'EQT', 'ES', 'ESRX', 'ESS', 'ETFC', 'ETN', 'ETR',
       'EW', 'EXC', 'EXPD', 'EXPE', 'EXR', 'F', 'FAST', 'FB', 'FBHS',
       'FCX', 'FDX', 'FE', 'FFIV', 'FIS', 'FISV', 'FITB', 'FL', 'FLIR',
       'FLR', 'FLS', 'FMC', 'FOX', 'FOXA', 'FRT', 'FSLR', 'FTI', 'FTR',
       'GD', 'GE', 'GGP', 'GILD', 'GIS', 'GLW', 'GM', 'GOOG', 'GOOGL',
       'GPC', 'GPN', 'GPS', 'GRMN', 'GS', 'GT', 'GWW', 'HAL', 'HAR',
       'HAS', 'HBAN', 'HBI', 'HCA', 'HCN', 'HCP', 'HD', 'HES', 'HIG',
       'HOG', 'HOLX', 'HON', 'HOT', 'HP', 'HPE', 'HPQ', 'HRB', 'HRL',
       'HRS', 'HSIC', 'HST', 'HSY', 'HUM', 'IBM', 'ICE', 'IFF', 'ILMN',
       'INTC', 'INTU', 'IP', 'IPG', 'IR', 'IRM', 'ISRG', 'ITW', 'IVZ',
       'JBHT', 'JCI', 'JEC', 'JNJ', 'JNPR', 'JPM', 'JWN', 'K', 'KEY',
       'KHC', 'KIM', 'KLAC', 'KMB', 'KMI', 'KMX', 'KO', 'KORS', 'KR',
       'KSS', 'KSU', 'L', 'LB', 'LEG', 'LEN', 'LH', 'LKQ', 'LLL', 'LLTC',
       'LLY', 'LM', 'LMT', 'LNC', 'LNT', 'LOW', 'LRCX', 'LUK', 'LUV',
       'LVLT', 'LYB', 'M', 'MA', 'MAC', 'MAR', 'MAS', 'MAT', 'MCD',
       'MCHP', 'MCK', 'MCO', 'MDLZ', 'MDT', 'MET', 'MHK', 'MJN', 'MKC',
       'MLM', 'MMC', 'MMM', 'MNK', 'MNST', 'MO', 'MON', 'MOS', 'MPC',
       'MRK', 'MRO', 'MS', 'MSFT', 'MSI', 'MTB', 'MU', 'MUR', 'MYL',
       'NAVI', 'NBL', 'NDAQ', 'NEE', 'NEM', 'NFLX', 'NFX', 'NI', 'NKE',
       'NLSN', 'NOC', 'NOV', 'NRG', 'NSC', 'NTAP', 'NTRS', 'NUE', 'NVDA',
       'NWL', 'NWS', 'NWSA', 'O', 'OI', 'OKE', 'OMC', 'ORCL', 'ORLY',
       'OXY', 'PAYX', 'PBCT', 'PBI', 'PCAR', 'PCG', 'PCLN', 'PDCO', 'PEG',
       'PEP', 'PFE', 'PFG', 'PG', 'PGR', 'PH', 'PHM', 'PKI', 'PLD', 'PM',
       'PNC', 'PNR', 'PNW', 'PPG', 'PPL', 'PRGO', 'PRU', 'PSA', 'PSX',
       'PVH', 'PWR', 'PX', 'PXD', 'PYPL', 'QCOM', 'QRVO', 'R', 'RAI',
       'RCL', 'REGN', 'RF', 'RHI', 'RHT', 'RIG', 'RL', 'ROK', 'ROP',
       'ROST', 'RRC', 'RSG', 'RTN', 'SBUX', 'SCG', 'SCHW', 'SE', 'SEE',
       'SHW', 'SIG', 'SJM', 'SLB', 'SLG', 'SNA', 'SNI', 'SO', 'SPG',
       'SPGI', 'SPLS', 'SRCL', 'SRE', 'STI', 'STJ', 'STT', 'STX', 'STZ',
       'SWK', 'SWKS', 'SWN', 'SYF', 'SYK', 'SYMC', 'SYY', 'T', 'TAP',
       'TDC', 'TDG', 'TEL', 'TGNA', 'TGT', 'TIF', 'TJX', 'TMK', 'TMO',
       'TRIP', 'TROW', 'TRV', 'TSCO', 'TSN', 'TSO', 'TSS', 'TWX', 'TXN',
       'TXT', 'TYC', 'UA', 'UA.C', 'UAL', 'UDR', 'UHS', 'ULTA', 'UNH',
       'UNM', 'UNP', 'UPS', 'URBN', 'URI', 'USB', 'UTX', 'V', 'VAR',
       'VFC', 'VIAB', 'VLO', 'VMC', 'VNO', 'VRSK', 'VRSN', 'VRTX', 'VTR',
       'VZ', 'WAT', 'WBA', 'WDC', 'WEC', 'WFC', 'WFM', 'WHR', 'WLTW',
       'WM', 'WMB', 'WMT', 'WRK', 'WU', 'WY', 'WYN', 'WYNN', 'XEC', 'XEL',
       'XL', 'XLNX', 'XOM', 'XRAY', 'XRX', 'XYL', 'YHOO', 'YUM', 'ZBH',
       'ZION'], dtype=object)

In [42]:
import numpy as np

In [49]:
k = 20

In [50]:
kmeans = cluster.KMeans(k)
y_pred = kmeans.fit_predict(X)

In [51]:
for i in range(k):
    print(i, np.sum(y_pred == i))

0 68
1 48
2 14
3 4
4 6
5 65
6 3
7 31
8 19
9 1
10 23
11 31
12 37
13 1
14 81
15 25
16 2
17 1
18 25
19 16

In [59]:
for i in range(10):
    groups = list(symbols[y_pred == i])
    print("cluster", i, ":", groups, "\n\n")

cluster 0 : ['AAP', 'AIG', 'AIZ', 'AMP', 'ATVI', 'AYI', 'BA', 'BBT', 'BEN', 'BK', 'BLK', 'BWA', 'CAT', 'CELG', 'CFG', 'COF', 'CSCO', 'DHI', 'ETN', 'FAST', 'FTR', 'GLW', 'GM', 'GPC', 'GRMN', 'GS', 'GWW', 'HAL', 'HAR', 'HCA', 'HES', 'HOLX', 'HON', 'HOT', 'HRS', 'INTC', 'JPM', 'L', 'LB', 'LM', 'LUK', 'MAR', 'MCHP', 'NOC', 'ORCL', 'PBCT', 'PBI', 'PFG', 'PH', 'PNC', 'PX', 'QCOM', 'RCL', 'RL', 'SLB', 'SNI', 'STI', 'STT', 'STX', 'TDC', 'TXN', 'URI', 'USB', 'UTX', 'V', 'WFC', 'WMB', 'WYN']


cluster 1 : ['AES', 'AMZN', 'BMY', 'CAH', 'CHD', 'CL', 'CLX', 'CPB', 'DG', 'DRI', 'EFX', 'EXC', 'EXPD', 'EXR', 'FB', 'FISV', 'FOX', 'FOXA', 'FRT', 'FSLR', 'HAS', 'HUM', 'JNJ', 'KHC', 'LEG', 'MCD', 'MDLZ', 'MKC', 'MO', 'NEM', 'PCG', 'PCLN', 'PGR', 'PM', 'PSA', 'RSG', 'SBUX', 'SJM', 'SRE', 'SYK', 'T', 'TAP', 'TSCO', 'UNH', 'VNO', 'WHR', 'WM', 'WMT']


cluster 2 : ['AAL', 'CF', 'EA', 'HOG', 'ILMN', 'JNPR', 'NOV', 'RF', 'SWKS', 'TXT', 'UA', 'UA.C', 'WDC', 'XYL']


cluster 3 : ['BHI', 'KSS', 'MU', 'SWN']


cluster 4 : ['AA', 'DO', 'FCX', 'LYB', 'NUE', 'WYNN']


cluster 5 : ['A', 'ABBV', 'ABC', 'ABT', 'ADM', 'AET', 'ALL', 'APH', 'AVY', 'BSX', 'CCI', 'CCL', 'COL', 'CSX', 'CTXS', 'CVS', 'DFS', 'DNB', 'DPS', 'EL', 'EMC', 'EQR', 'EQT', 'GILD', 'GIS', 'GOOGL', 'ICE', 'IRM', 'ITW', 'IVZ', 'JBHT', 'K', 'KIM', 'KMB', 'LOW', 'MAC', 'MHK', 'MJN', 'MMC', 'NDAQ', 'NEE', 'NLSN', 'PAYX', 'PEP', 'PG', 'PYPL', 'REGN', 'RTN', 'SLG', 'SPG', 'SRCL', 'STJ', 'STZ', 'SYF', 'TJX', 'TRV', 'TWX', 'UDR', 'ULTA', 'VFC', 'VLO', 'WBA', 'XEC', 'XLNX', 'YUM']


cluster 6 : ['CI', 'NVDA', 'YHOO']


cluster 7 : ['ALK', 'AN', 'COH', 'CSRA', 'DD', 'DLPH', 'DOV', 'DOW', 'EBAY', 'ETFC', 'FLR', 'FMC', 'HP', 'INTU', 'JCI', 'JEC', 'LEN', 'LUV', 'MET', 'MSI', 'NSC', 'NTRS', 'PHM', 'ROK', 'ROP', 'SPLS', 'TDG', 'TYC', 'UNP', 'VMC', 'XRX']


cluster 8 : ['BAX', 'BDX', 'CBS', 'CTL', 'DLTR', 'DVA', 'FLIR', 'HSIC', 'IBM', 'IP', 'LVLT', 'NRG', 'PDCO', 'SNA', 'TMO', 'VRSN', 'WLTW', 'WRK', 'WY']


cluster 9 : ['CHK']